namespace Chapter4_1_1 {
    internal class Program {
        /* 問題4.1
           以下の順にyearMonthクラスを定義してください。本章で学んだイディオムが使えるところは
           イディオムを使ってください。

           1. 年(Year)と月(Month)の2つのプロパティを持つクラスYearMonthを定義してください。
              2つのプロパティは読み取り専用にし、値はコンストラクタで指定出来るようにしてください。
              なお、引数で渡される月の値は1から12の範囲であるものと仮定してよいです。

           2. YearMonthクラスに、Is21Centuryプロパティを追加してください。
              2001年から2100年までが21世紀です。
              この処理では加減乗除はしないでください。

           3. YearMonthクラスに、1ヶ月後を求めるAddOneMonthメソッドを追加してください。
              このとき、自分自身のプロパティは変更せずに、新たなYearMonthオブジェクトを生成し、
              その値を返してください。12月の時の処理に注意してください

           4. ToStringメソッドをオーバーライドしてください。
              結果は"2017年8月"といった形式にしてください。
        */
        static void Main(string[] args) {
        }
    }
}
